tests/load/basic-load.yml
config:
  target: 'http://localhost:3000'
  phases:
    # Warm-up muy conservador por el rate limit
    - duration: 60
      arrivalRate: 5
      name: "Warming up"
    
    # Load test gradual 
    - duration: 180
      arrivalRate: 3
      rampTo: 8
      name: "Normal load"
    
    # Peak load moderado (respetando rate limit)
    - duration: 120
      arrivalRate: 8
      name: "Peak load"
    
    # Cool down
    - duration: 60
      arrivalRate: 2
      name: "Cool down"

  # Configuración HTTP optimizada para tu rate limit
  http:
    timeout: 15
    maxSockets: 10
    pool: 5
    
  # Processor para manejo de JWT
  processor: '../processors/auth-processor.js'
  adminEmail: "ariadna.admin@pasteleria.com"
  adminPassword: "AdminSecurePass123!"
  customerEmail: "carlos.customer@pasteleria.com"
  customerPassword: "ClienteConfiable456*"

scenarios:
  # 25% - Endpoints públicos (sin auth, no afectan rate limit tanto)
  - name: "Public Endpoints"
    weight: 25
    flow:
      - get:
          url: "/"
          expect:
            - statusCode: 200
      - think: 2
      - get:
          url: "/health"
          expect:
            - statusCode: 200
      - think: 1
      - get:
          url: "/docs-info"
          expect:
            - statusCode: 200

  # 35% - Proceso de autenticación (crítico para el resto)
  - name: "Authentication Flow"
    weight: 35
    flow:
      # Login exitoso con admin
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ adminEmail }}"
            password: "{{ adminPassword }}"
          expect:
            - statusCode: 200
          capture:
            - json: "$.data.token"  
              as: "adminToken"
      
      - think: 3
      
      # Login con customer (diversidad de usuarios)
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ customerEmail }}"
            password: "{{ customerPassword }}"
          expect:
            - statusCode: 200
          capture:
            - json: "$.data.token"  # ✅ CORREGIDO: Ruta correcta al token
              as: "customerToken"
      
      - think: 2
      
      # Test de login fallido (validar manejo de errores)
      - post:
          url: "/api/auth/login"
          json:
            email: "wrong@email.com"
            password: "wrongpassword"
          expect:
            - statusCode: [401, 400]

  # 25% - Endpoints de productos (requieren auth)
  - name: "Products API"
    weight: 25
    flow:
      # Login para obtener token
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ adminEmail }}"
            password: "{{ adminPassword }}"
          capture:
            - json: "$.data.token"  # ✅ CORREGIDO
              as: "authToken"
      
      - think: 2
      
      # Obtener todos los productos
      - get:
          url: "/api/v1/products"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200
      
      - think: 3
      
      # Obtener producto específico
      - get:
          url: "/api/v1/products/1"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: [200, 404]
      
      - think: 4
      
      # Crear producto nuevo (solo admin)
      - post:
          url: "/api/v1/products"
          headers:
            Authorization: "Bearer {{ authToken }}"
            Content-Type: "application/json"
          json:
            name: "Pastel Test {{ $randomString() }}"
            description: "Pastel generado en load test"
            price: "{{ $randomInt(100, 500) }}"
            category_id: 1
          expect:
            - statusCode: [201, 400, 403, 429]
          ifTrue:
            - statusCode: 429
          then:
            - think: 10

  # 10% - Endpoints de categorías
  - name: "Categories API"
    weight: 10
    flow:
      # Login
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ adminEmail }}"
            password: "{{ adminPassword }}"
          capture:
            - json: "$.data.token"  # ✅ CORREGIDO
              as: "authToken"
      
      - think: 3
      
      # Obtener categorías
      - get:
          url: "/api/v1/categories"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: [200, 429]

  # 5% - Ingredientes
  - name: "Ingredients API"
    weight: 5
    flow:
      # Login
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ adminEmail }}"
            password: "{{ adminPassword }}"
          capture:
            - json: "$.data.token"  # ✅ CORREGIDO
              as: "authToken"
      
      - think: 3
      
      # Ingredientes
      - get:
          url: "/api/v1/ingredients"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: [200, 429]

  # 10% - Order Status y Orders API
  - name: "Orders API"
    weight: 10
    flow:
      # Login con admin para acceder a orders
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ adminEmail }}"
            password: "{{ adminPassword }}"
          capture:
            - json: "$.data.token"
              as: "authToken"
      
      - think: 3
      
      # Order Status
      - get:
          url: "/api/v1/order-status"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: [200, 429]
      
      - think: 5
      
      # Obtener todas las órdenes (requiere admin)
      - get:
          url: "/api/v1/orders"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: [200, 403, 429]  # 403 si no es admin

# Configuración adicional para manejo de errores
defaults:
  headers:
    User-Agent: "Artillery Load Test"
    Accept: "application/json"